ee230/C8051F/Examples/C8051T622_3_T326_7/USB_Suspend/T622_USB0_Standard_Requests.c
   // Verify that the requested descriptor is valid
   if (SETUP.wValue.U8[MSB] == DSC_DEVICE ||
   SETUP.wValue.U8[MSB] == DSC_CONFIG     ||
   SETUP.wValue.U8[MSB] == DSC_STRING     ||
   SETUP.wValue.U8[MSB] == DSC_INTERFACE  ||
   SETUP.wValue.U8[MSB] == DSC_ENDPOINT)
   {
      if ((SETUP.wLength.U8[LSB] < DATASIZE) &&
      (SETUP.wLength.U8[MSB] == 0))
      {
         DATASIZE = SETUP.wLength.U16;   // Send only requested amount of data
      }
   }
   if (EP_STATUS[0] != EP_STALL)       // Make sure endpoint not in stall mode
   {
     POLL_WRITE_BYTE (E0CSR, rbSOPRDY);// Service SETUP Packet
     EP_STATUS[0] = EP_TX;             // Put endpoint in transmit mode
     DATASENT = 0;                     // Reset Data Sent counter
   }
}

//-----------------------------------------------------------------------------
// Get_Configuration
//-----------------------------------------------------------------------------
//
// Return Value - None
// Parameters - None
//
// Standard request that should not change in custom HID designs.
//
//-----------------------------------------------------------------------------
void Get_Configuration (void)          // This routine returns current
{                                      // configuration value
   // This request must be directed to the device
   if ( (SETUP.bmRequestType != OUT_DEVICE)    ||
   // With value word set to zero
   SETUP.wValue.U8[MSB]  || SETUP.wValue.U8[LSB]||
   // And index set to zero
   SETUP.wIndex.U8[MSB]  || SETUP.wIndex.U8[LSB]||
   // And SETUP length set to one
   SETUP.wLength.U8[MSB] || (SETUP.wLength.U8[LSB] != 1) )
   {
      Force_Stall ();                  // Otherwise send a stall to host
   }

   else
   {
      if (USB0_STATE == DEV_CONFIGURED)// If the device is configured, then
      {                                // return value 0x01 since this software
                                       // only supports one configuration
         DATAPTR = (unsigned char*)&ONES_PACKET;
         DATASIZE = 1;
      }
      if (USB0_STATE == DEV_ADDRESS)   // If the device is in address state, it
      {                                // is not configured, so return 0x00
         DATAPTR = (unsigned char*)&ZERO_PACKET;
         DATASIZE = 1;
      }
   }
   if (EP_STATUS[0] != EP_STALL)
   {
      // Set Serviced Out Packet bit
      POLL_WRITE_BYTE (E0CSR, rbSOPRDY);
      EP_STATUS[0] = EP_TX;            // Put endpoint into transmit mode
      DATASENT = 0;                    // Reset Data Sent counter to zero
   }
}

//-----------------------------------------------------------------------------
// Set_Configuration
//-----------------------------------------------------------------------------
//
// Return Value - None
// Parameters - None
//
// Standard request that should not change in custom HID designs.
//
//-----------------------------------------------------------------------------
void Set_Configuration (void)          // This routine allows host to change
{                                      // current device configuration value

   // Device must be addressed before configured
   if ((USB0_STATE == DEV_DEFAULT) ||
   // and request recipient must be the device
   (SETUP.bmRequestType != IN_DEVICE) ||
   // the index and length words must be zero
   SETUP.wIndex.U8[MSB]  || SETUP.wIndex.U8[LSB]||
   SETUP.wLength.U8[MSB] || SETUP.wLength.U8[LSB] ||
   SETUP.wValue.U8[MSB]  || (SETUP.wValue.U8[LSB] > 1))
   // This software only supports config = 0,1
   {
      Force_Stall ();                  // Send stall if SETUP data is invalid
   }

   else
   {
      if (SETUP.wValue.U8[LSB] > 0)     // Any positive configuration request
      {                                // results in configuration being set
                                // to 1
         USB0_STATE = DEV_CONFIGURED;
         EP_STATUS[1] = EP_IDLE;       // Set endpoint status to idle (enabled)

         POLL_WRITE_BYTE (INDEX, 1);   // Change index to endpoint 1
         // Set DIRSEL to indicate endpoint 1 is IN/OUT
         POLL_WRITE_BYTE (EINCSR2, rbInSPLIT);
         POLL_WRITE_BYTE (INDEX, 0);   // Set index back to endpoint 0

         Handle_In1();
      }
      else
      {
         USB0_STATE = DEV_ADDRESS;     // Unconfigures device by setting state
         EP_STATUS[1] = EP_HALT;       // to address, and changing endpoint
                                       // 1 and 2
      }
   }
   if (EP_STATUS[0] != EP_STALL)
   {
      POLL_WRITE_BYTE (E0CSR, (rbSOPRDY | rbDATAEND));
                                       // Indicate SETUP packet has been
                                       // serviced
   }
}

//-----------------------------------------------------------------------------
// Get_Interface
//-----------------------------------------------------------------------------
//
// Return Value - None
// Parameters - Non
//
// Standard request that should not change in custom HID designs.
//
//-----------------------------------------------------------------------------
void Get_Interface (void)              // This routine returns 0x00, since
{                                      // only one interface is supported by
                                       // this firmware

   // If device is not configured
   if ((USB0_STATE != DEV_CONFIGURED) ||
   // or recipient is not an interface
   (SETUP.bmRequestType != OUT_INTERFACE) ||
   // or non-zero value or index fields
   SETUP.wValue.U8[MSB]  ||SETUP.wValue.U8[LSB] ||
   // or data length not equal to one
   SETUP.wIndex.U8[MSB]  ||SETUP.wIndex.U8[LSB] ||
   SETUP.wLength.U8[MSB] ||(SETUP.wLength.U8[LSB] != 1))
   {
      Force_Stall ();                  // Then return stall due to invalid
                                       // request
   }

   else
   {
     // Otherwise, return 0x00 to host
      DATAPTR = (unsigned char*)&ZERO_PACKET;
      DATASIZE = 1;
   }
   if (EP_STATUS[0] != EP_STALL)
   {
     // Set Serviced SETUP packet, put endpoint in transmit mode and reset
     // Data sent counter
      POLL_WRITE_BYTE (E0CSR, rbSOPRDY);
      EP_STATUS[0] = EP_TX;
      DATASENT = 0;
   }
}

