ee230/C8051F/Examples/C8051T622_3_T326_7/USB_Suspend/T622_USB0_Standard_Requests.c
//-----------------------------------------------------------------------------
// Set_Interface
//-----------------------------------------------------------------------------
//
// Return Value - None
// Parameters - None
//
// Standard request that should not change in custom HID designs.
//
//-----------------------------------------------------------------------------
void Set_Interface (void)
{
   // Make sure request is directed at interface
   if ((SETUP.bmRequestType != IN_INTERFACE)  ||
   // and all other packet values are set to zero
   SETUP.wLength.U8[MSB] ||SETUP.wLength.U8[LSB]||
   SETUP.wValue.U8[MSB]  ||SETUP.wValue.U8[LSB] ||
   SETUP.wIndex.U8[MSB]  ||SETUP.wIndex.U8[LSB])
   {
      Force_Stall ();                  // Othewise send a stall to host
   }
   if (EP_STATUS[0] != EP_STALL)
   {
      POLL_WRITE_BYTE (E0CSR, (rbSOPRDY | rbDATAEND));
                                       // Indicate SETUP packet has been
                                       // serviced
   }
}

//-----------------------------------------------------------------------------
// Get_Idle
//-----------------------------------------------------------------------------
// Not supported.
//
//-----------------------------------------------------------------------------
void Get_Idle(void) {
}

//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Get_Protocol
//-----------------------------------------------------------------------------
// Not supported.
//
//-----------------------------------------------------------------------------
void Get_Protocol(void) { }

//-----------------------------------------------------------------------------
// Set_Protocol
//-----------------------------------------------------------------------------
// Not supported.
//
//-----------------------------------------------------------------------------
void Set_Protocol (void) { }

//-----------------------------------------------------------------------------
// Set_Idle()
//-----------------------------------------------------------------------------
//
// Return Value - None
// Parameters - None
//
// Description: Sets the idle feature on interrupt in endpoint.
//-----------------------------------------------------------------------------
void Set_Idle (void)
{

   if (EP_STATUS[0] != EP_STALL)
   {
      // Set serviced SETUP Packet
      POLL_WRITE_BYTE (E0CSR, (rbSOPRDY | rbDATAEND));
   }

}



//-----------------------------------------------------------------------------
// Get_Report()
//-----------------------------------------------------------------------------
//
// Return Value - None
// Parameters - None
//
// Description: Sends a given report type to the host.
//
//-----------------------------------------------------------------------------
void Get_Report (void)
{
   // call appropriate handler to prepare buffer
   ReportHandler_IN_ISR(SETUP.wValue.U8[LSB]);
   // set DATAPTR to buffer used inside Control Endpoint
   DATAPTR = IN_BUFFER.Ptr;
   DATASIZE = IN_BUFFER.Length;

   if (EP_STATUS[0] != EP_STALL)
   {
     // Set serviced SETUP Packet
      POLL_WRITE_BYTE (E0CSR, rbSOPRDY);
      EP_STATUS[0] = EP_TX;            // Endpoint 0 in transmit mode
      DATASENT = 0;                    // Reset DATASENT counter
   }
}



//-----------------------------------------------------------------------------
// Set_Report()
//-----------------------------------------------------------------------------
//
// Return Value - None
// Parameters - None
//
// Description: Receives a report sent from the host.
//
//-----------------------------------------------------------------------------
void Set_Report (void)
{
   // prepare buffer for OUT packet
   Setup_OUT_BUFFER ();

   // set DATAPTR to buffer
   DATAPTR = OUT_BUFFER.Ptr;
   DATASIZE = SETUP.wLength.U16;

   if (EP_STATUS[0] != EP_STALL)
   {
     // Set serviced SETUP Packet
      POLL_WRITE_BYTE (E0CSR, rbSOPRDY);
      EP_STATUS[0] = EP_RX;            // Endpoint 0 in transmit mode
      DATASENT = 0;                    // Reset DATASENT counter
   }
}

//-----------------------------------------------------------------------------
// End of File
//-----------------------------------------------------------------------------
